module Grammar (
   НетерминалыМУР128(..),

   ТерминалыМУР128(..),

   грамматикаМУР128
) where

import Rules

--ЧелослиленныйРегистр(Ринт)
--ВещественныйРегистр(Финт)
--СП
--БП(стек)
--Movim
--Loadreg
--Storereg
--PushPopIm
--Arifm3Args до ршифта + сравнения
--MovRegF
--StoreRegF
--LoadRegF
--Pup
--Arifm3F
--Arifm2F + chsf
--Mul2f
--JumpReg1
--JumprReg2
--JumpCC
--JumorCCReg
--CallRel
--CellCon
--Ret + Reti
--Reta
--RetaCon

data ТерминалыМУР128 =
  RInt        | FInt          | SP         | BP         | Movim     |
  LoadReg     | StoreReg      | PushPopIm  | Arifm3Args | MovRegF   |
  StoreRegF   | LoadRegF      | Pup        | Arifm3F    | Arifm2F   |
  Mul2f       | JumpReg1      | JumprReg2  | JumpCC     | JumpCCReg |
  CallRel     | CellCon       | Ret        | Reta       | RetaCon   |
  OpenBracket | CloseBracket  | StartBlock | EndBlock   | Id        |
  Semicolon   | Readable      | Writable   | Executable | Enter     |
  Macro       | Epsilon       | Comma      | OpenBrace  | CloseBrace|
  Prescision  | Pluse         | Minus      | Mul        | Div       |
  Mod         | Xor           | Or         | Add        | Not       |
  Single      | Double        | Quatro     | Extended   | Integer   |
  ExpSign


 deriving(Eq,Show,Ord,Read,Enum,Bounded)

data НетерминалыМУР128 =
  Programm       | EntryPoint  | Body     | Section         |
  Attr           | Args
 deriving(Eq,Show,Ord,Read,Enum,Bounded)

грамматикаМУР128 :: [Правило НетерминалыМУР128 ТерминалыМУР128]
грамматикаМУР128 =
   [
    Программа --> [Терминал Формат, Терминал МУР, Терминал ОткрФигСкобка, Нетерминал ТочкаВхода, Нетерминал ТелоПрограммы, Терминал ЗакрФигСкобка],
    ТелоПрограммы --> [Нетерминал Макрос],
    ТелоПрограммы --> [Нетерминал Секция],
    ТелоПрограммы --> [Нетерминал ТелоПрограммы, Нетерминал Макрос],
    ТелоПрограммы --> [Нетерминал ТелоПрограммы, Нетерминал Секция],
    ТочкаВхода --> [Терминал Вход, Терминал Ид],
    Секция --> [Терминал Section, Нетерминал АтрибутыСекции, Терминал ОткрФигСкобка, Нетерминал ТелоСекции, Терминал ЗакрФигСкобка],
    АтрибутыСекции --> [Нетерминал АтрибутСекции],
    АтрибутыСекции --> [Нетерминал АтрибутыСекции, Нетерминал АтрибутСекции],
    АтрибутСекции --> [Терминал Читаемый],
    АтрибутСекции --> [Терминал Записываемый],
    АтрибутСекции --> [Терминал Исполняемый],
    ТелоСекции --> [Нетерминал Команда],
    ТелоСекции --> [Нетерминал Макрос],
    ТелоСекции --> [Терминал Ид, Терминал ТочкаЗапятая],
    ТелоСекции --> [Нетерминал ТелоСекции, Терминал ТочкаЗапятая, Нетерминал Команда],
    ТелоСекции --> [Нетерминал ТелоСекции, Терминал ТочкаЗапятая, Нетерминал Макрос],
    ТелоСекции --> [Нетерминал ТелоСекции, Терминал ТочкаЗапятая, Терминал Ид, Терминал ТочкаЗапятая],
    Макрос --> [Терминал Макро, Терминал Ид, Нетерминал Аргументы, Терминал ОткрФигСкобка, Нетерминал ТелоМакроса, Терминал ЗакрФигСкобка],
    Аргументы --> [Терминал Эпсилон],
    Аргументы --> [Нетерминал Аргументы'],
    Аргументы' --> [Терминал Ид],
    Аргументы' --> [Нетерминал Аргументы', Терминал Зап, Терминал Ид],
    ТелоМакроса --> [Терминал ОткрФигСкобка, Нетерминал Команда, Терминал ЗакрФигСкобка],
    ТелоМакроса --> [Терминал ОткрФигСкобка, Терминал Ид, Терминал ТочкаЗапятая, Терминал ЗакрФигСкобка],
    ТелоМакроса --> [Терминал ОткрФигСкобка, Нетерминал ТелоМакроса, Терминал ТочкаЗапятая, Нетерминал Команда, Терминал ЗакрФигСкобка],
    ТелоМакроса --> [Терминал ОткрФигСкобка, Нетерминал ТелоМакроса, Терминал ТочкаЗапятая, Терминал Ид, Терминал ТочкаЗапятая, Терминал ЗакрФигСкобка],
    Команда --> [Терминал ОткрКругСкобка, Терминал Ид, Терминал ТочкаЗапятая, Терминал ЗакрКругСкобка, Терминал Вопрос, Нетерминал Макрос, Нетерминал Аргументы],
    Команда --> [Терминал ЦелочислПорязрядОперации],
    Команда --> [Терминал ЦелочислАрифмОперации]

   ]
